{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "6d946c38-e55c-40e2-a679-f061a365e25a",
   "metadata": {},
   "outputs": [],
   "source": [
    "#| hide\n",
    "import nbdev; nbdev.nbdev_export()\n",
    "import kglab\n",
    "import pandas as pd"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "5a27fdd0-2848-433e-88ec-88e1d0824f36",
   "metadata": {},
   "source": [
    "# Core Functions"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "1f76a2fc-fa1f-4027-9c3d-2a65e62fa9ad",
   "metadata": {},
   "source": [
    "This page defines all boilerplate functions to be used when analyzing sboms.  To see these functions in action please view the following pages."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "d7f838ca-da7f-4de2-8e84-1a1cf1a137ff",
   "metadata": {},
   "source": [
    "#| hide\n",
    "### Load KG for testing"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "6382042f-3b41-4195-ac68-bd2fc66a5332",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<kglab.kglab.KnowledgeGraph>"
      ]
     },
     "execution_count": null,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#| hide\n",
    "import kglab\n",
    "kg = kglab.KnowledgeGraph()\n",
    "kg.load_rdf(\"sboms/rdf/model.rdf.xml\", format=\"xml\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "b2c56be7-dd90-4ccf-ad36-e06a6f57bb05",
   "metadata": {},
   "outputs": [],
   "source": [
    "#| export\n",
    "def show_metadata(kg, dataframe=False):\n",
    "    \"\"\"\n",
    "    Return total number of triples, distict entities, and properties to a pandas dataframe.\n",
    "    \n",
    "    - `kg`: `KnowledgeGraph()` - Knowledge graph to query from\n",
    "    - `dataframe` : `bool` - Optionally, return result to dataframe\n",
    "    \"\"\"\n",
    "    \n",
    "    query = \"\"\"\n",
    "    SELECT \n",
    "        (COUNT(*) AS ?triples)\n",
    "        (COUNT(DISTINCT ?entity) AS ?entities)\n",
    "        (COUNT(DISTINCT ?property) AS ?properties)\n",
    "    WHERE {\n",
    "        ?subject ?property ?object .\n",
    "        BIND(?subject AS ?entity) .\n",
    "    }\n",
    "    \"\"\"\n",
    "\n",
    "    if dataframe:\n",
    "        return kg.query_as_df(query)\n",
    "\n",
    "    for row in kg.query(query):\n",
    "        print(\"Total Triples:\", row['triples'])\n",
    "        print(\"Distinct Entities:\", row['entities'])\n",
    "        print(\"Distinct Properties:\", row['properties'])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "c418e186-0582-45f3-a798-d8e88085e825",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Total Triples: 306\n",
      "Distinct Entities: 56\n",
      "Distinct Properties: 62\n"
     ]
    }
   ],
   "source": [
    "#| hide\n",
    "show_metadata(kg)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "36064c3a-4143-4872-803e-7c5480a3947f",
   "metadata": {},
   "source": [
    "**Number of Entities per Type**"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "60ac51e9-32c1-4083-856e-4a700e9b8776",
   "metadata": {},
   "outputs": [],
   "source": [
    "#| export\n",
    "def show_entity_types(kg, dataframe=False):\n",
    "    \"\"\"\n",
    "    Show counts of entity types\n",
    "    \n",
    "    - `kg`: `KnowledgeGraph()` - Knowledge graph to query from\n",
    "    - `dataframe` : `bool` - Optionally, return result to dataframe\n",
    "    \"\"\"\n",
    "    \n",
    "    query = \"\"\"\n",
    "    SELECT ?type (COUNT(?entity) as ?count)\n",
    "    WHERE {\n",
    "        ?entity a ?type .\n",
    "    }\n",
    "    GROUP BY ?type\n",
    "    ORDER BY DESC(?count)\n",
    "    \"\"\"\n",
    "    \n",
    "    if dataframe:\n",
    "        return kg.query_as_df(query)\n",
    "\n",
    "    result = kg.query(query)\n",
    "    for row in result:\n",
    "        print(row[\"type\"], \":\", row[\"count\"])\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "d30a51f7-7b90-4511-b672-ede9d77bbe2f",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "http://spdx.org/rdf/terms#Relationship : 11\n",
      "http://spdx.org/rdf/terms#Checksum : 10\n",
      "http://spdx.org/rdf/terms#ExtractedLicensingInfo : 5\n",
      "http://spdx.org/rdf/terms#Annotation : 5\n",
      "http://spdx.org/rdf/terms#Package : 4\n",
      "http://spdx.org/rdf/terms#File : 4\n",
      "http://spdx.org/rdf/terms#ExternalRef : 3\n",
      "http://spdx.org/rdf/terms#DisjunctiveLicenseSet : 2\n",
      "http://www.w3.org/2009/pointers#StartEndPointer : 2\n",
      "http://www.w3.org/2009/pointers#ByteOffsetPointer : 2\n",
      "http://www.w3.org/2009/pointers#LineCharPointer : 2\n",
      "http://spdx.org/rdf/terms#SpdxDocument : 1\n",
      "http://spdx.org/rdf/terms#PackageVerificationCode : 1\n",
      "http://spdx.org/rdf/terms#ConjunctiveLicenseSet : 1\n",
      "http://spdx.org/rdf/terms#CreationInfo : 1\n",
      "http://spdx.org/rdf/terms#ExternalDocumentRef : 1\n",
      "http://spdx.org/rdf/terms#Snippet : 1\n"
     ]
    }
   ],
   "source": [
    "#| hide\n",
    "show_entity_types(kg)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "25db254b-db55-4ca3-922d-987aaa29334b",
   "metadata": {},
   "outputs": [],
   "source": [
    "#| export\n",
    "def show_top_n_props(kg, n, dataframe=False):\n",
    "    \"\"\"\n",
    "    Display the top N properties from a knowledge graph\n",
    "    \n",
    "    - `kg`: `KnowledgeGraph()` - Knowledge graph to query from\n",
    "    - `n`: `int` - Top n results to display\n",
    "    - `dataframe` : `bool` - Optionally, return result to dataframe\n",
    "    \"\"\"\n",
    "    \n",
    "    query = \"\"\"\n",
    "    SELECT ?property (COUNT(?property) as ?count)\n",
    "    WHERE {\n",
    "        ?s ?property ?o .\n",
    "    }\n",
    "    GROUP BY ?property\n",
    "    ORDER BY DESC(?count)\n",
    "    LIMIT %d\n",
    "    \"\"\" % n\n",
    "    \n",
    "    if dataframe:\n",
    "        return kg.query_as_df(query)\n",
    "\n",
    "    result = kg.query(query)\n",
    "    for row in result:\n",
    "        print(row[\"property\"], \":\", row[\"count\"])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "ad429f9c-2c43-47d1-a723-81fbfa68dc57",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>property</th>\n",
       "      <th>count</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>rdf:type</td>\n",
       "      <td>56</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>rdfs:comment</td>\n",
       "      <td>14</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>spdx:relatedSpdxElement</td>\n",
       "      <td>11</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>spdx:fileContributor</td>\n",
       "      <td>11</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>spdx:relationship</td>\n",
       "      <td>11</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>spdx:relationshipType</td>\n",
       "      <td>11</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>spdx:checksumValue</td>\n",
       "      <td>10</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>spdx:checksum</td>\n",
       "      <td>10</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>spdx:algorithm</td>\n",
       "      <td>10</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>spdx:licenseConcluded</td>\n",
       "      <td>9</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                  property  count\n",
       "0                 rdf:type     56\n",
       "1             rdfs:comment     14\n",
       "2  spdx:relatedSpdxElement     11\n",
       "3     spdx:fileContributor     11\n",
       "4        spdx:relationship     11\n",
       "5    spdx:relationshipType     11\n",
       "6       spdx:checksumValue     10\n",
       "7            spdx:checksum     10\n",
       "8           spdx:algorithm     10\n",
       "9    spdx:licenseConcluded      9"
      ]
     },
     "execution_count": null,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#| hide\n",
    "show_top_n_props(kg, 10, dataframe=True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "9b5b7625-7059-4e2d-a5c7-83f49cddb9f9",
   "metadata": {},
   "outputs": [],
   "source": [
    "#| export\n",
    "import kglab\n",
    "def show_measures(kg:kglab.KnowledgeGraph()): #Knowledge graph to query from\n",
    "    \"\"\"\n",
    "    Display number of nodes and edges for knowledge graph\n",
    "    \"\"\"\n",
    "    measure = kglab.Measure()\n",
    "    measure.measure_graph(kg)\n",
    "\n",
    "    print(\"edges\", measure.get_edge_count())\n",
    "    print(\"nodes\", measure.get_node_count())"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "2cb54288-b54b-4a02-9e9b-ad4d2da04f84",
   "metadata": {},
   "source": [
    "## Files"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "24ee3c3d-e40d-4f18-bbc8-f7de53746f80",
   "metadata": {},
   "source": [
    "Contained file schema"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "3ae484af-73ed-4a2f-930e-d69aa151671e",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>property</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>rdf:type</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>spdx:licenseInfoInFile</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>rdfs:comment</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>spdx:licenseConcluded</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>spdx:checksum</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>spdx:fileContributor</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>spdx:fileType</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>spdx:relationship</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>spdx:licenseComments</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>spdx:fileName</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>spdx:copyrightText</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>spdx:noticeText</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>spdx:annotation</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                  property\n",
       "0                 rdf:type\n",
       "1   spdx:licenseInfoInFile\n",
       "2             rdfs:comment\n",
       "3    spdx:licenseConcluded\n",
       "4            spdx:checksum\n",
       "5     spdx:fileContributor\n",
       "6            spdx:fileType\n",
       "7        spdx:relationship\n",
       "8     spdx:licenseComments\n",
       "9            spdx:fileName\n",
       "10      spdx:copyrightText\n",
       "11         spdx:noticeText\n",
       "12         spdx:annotation"
      ]
     },
     "execution_count": null,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#| echo: false\n",
    "query = \"\"\"\n",
    "PREFIX spdx:<http://spdx.org/rdf/terms#>\n",
    "SELECT DISTINCT ?property\n",
    "WHERE {\n",
    "  ?file rdf:type spdx:File .\n",
    "  ?file ?property ?value .\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "\n",
    "df = kg.query_as_df(query)\n",
    "df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "7fa3f855-1cb6-48c4-922c-1f17291b338c",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Warning: When  cdn_resources is 'local' jupyter notebook has issues displaying graphics on chrome/safari. Use cdn_resources='in_line' or cdn_resources='remote' if you have issues viewing graphics in a notebook.\n",
      "tmp.fig.html\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "\n",
       "        <iframe\n",
       "            width=\"100%\"\n",
       "            height=\"600px\"\n",
       "            src=\"tmp.fig.html\"\n",
       "            frameborder=\"0\"\n",
       "            allowfullscreen\n",
       "            \n",
       "        ></iframe>\n",
       "        "
      ],
      "text/plain": [
       "<IPython.lib.display.IFrame>"
      ]
     },
     "execution_count": null,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "namespaces = {\n",
    "    \"spdx\": \"http://spdx.org/rdf/terms#\"\n",
    "}\n",
    "subgraph = kglab.KnowledgeGraph(\n",
    "    namespaces = namespaces,\n",
    ")\n",
    "query = \"\"\"\n",
    "PREFIX spdx:<http://spdx.org/rdf/terms#>\n",
    "CONSTRUCT {\n",
    "    ?file rdf:type spdx:File .\n",
    "    ?file spdx:fileName ?fileName .\n",
    "    ?file spdx:fileContributor ?contributor .\n",
    "    ?file spdx:licenseInfoInFile ?licenseInFile .\n",
    "    ?file spdx:checksum ?checksum .\n",
    "    ?file spdx:relationship ?relationship .\n",
    "}\n",
    "WHERE {\n",
    "    ?file rdf:type spdx:File .\n",
    "    ?file spdx:fileName ?fileName .\n",
    "    ?file spdx:fileContributor ?contributor .\n",
    "    ?file spdx:licenseInfoInFile ?licenseInFile .\n",
    "    OPTIONAL {?file spdx:relationship ?relationship .}\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "for row in kg.query(query):\n",
    "    s, p, o = row\n",
    "    subgraph.add(s, p, o)\n",
    "    \n",
    "VIS_STYLE = {\n",
    "    \"spdx\": {\n",
    "        \"color\": \"orange\",\n",
    "        \"size\": 40,\n",
    "    },\n",
    "    \"rdf\":{\n",
    "        \"color\": \"red\",\n",
    "        \"size\": 30,\n",
    "    },\n",
    "}\n",
    "g = kglab.SubgraphTensor(subgraph)\n",
    "pyvis_graph = g.build_pyvis_graph(notebook=True, style=VIS_STYLE)\n",
    "pyvis_graph.force_atlas_2based()\n",
    "pyvis_graph.show(\"tmp.fig.html\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "c0c6832a-5f3c-495a-bb8d-7766b82b0d9c",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>fileID</th>\n",
       "      <th>fileName</th>\n",
       "      <th>fileType</th>\n",
       "      <th>licenseInFile</th>\n",
       "      <th>contributors</th>\n",
       "      <th>licenseConcluded</th>\n",
       "      <th>checksum</th>\n",
       "      <th>relationship</th>\n",
       "      <th>comment</th>\n",
       "      <th>licenseComments</th>\n",
       "      <th>noticeText</th>\n",
       "      <th>annotation</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>&lt;http://spdx.org/spdxdocs/spdx-example-444504E...</td>\n",
       "      <td>./lib-source/jena-2.6.3-sources.jar</td>\n",
       "      <td>spdx:fileType_archive</td>\n",
       "      <td>&lt;http://spdx.org/spdxdocs/spdx-example-444504E...</td>\n",
       "      <td>Apache Software Foundation, Hewlett Packard Inc.</td>\n",
       "      <td>http://spdx.org/spdxdocs/spdx-example-444504E0...</td>\n",
       "      <td>_:N8d065bb23af54166a7807b66fd413fc3</td>\n",
       "      <td>_:N5169ddfc0196483381a7f89eed5068a7</td>\n",
       "      <td>This file belongs to Jena</td>\n",
       "      <td>This license is used by Jena</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>&lt;http://spdx.org/spdxdocs/spdx-example-444504E...</td>\n",
       "      <td>./lib-source/commons-lang3-3.1-sources.jar</td>\n",
       "      <td>spdx:fileType_archive</td>\n",
       "      <td>&lt;http://spdx.org/licenses/Apache-2.0&gt;</td>\n",
       "      <td>Apache Software Foundation</td>\n",
       "      <td>http://spdx.org/licenses/Apache-2.0</td>\n",
       "      <td>_:Nc213ffa88a6d48e3b10d0d7c11b6566e</td>\n",
       "      <td>_:Nb4a82500dd3d4bacb47e5fcf9e144605</td>\n",
       "      <td>This file is used by Jena</td>\n",
       "      <td>NaN</td>\n",
       "      <td>Apache Commons Lang\\nCopyright 2001-2011 The A...</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>&lt;http://spdx.org/spdxdocs/spdx-example-444504E...</td>\n",
       "      <td>./src/org/spdx/parser/DOAPProject.java</td>\n",
       "      <td>spdx:fileType_source</td>\n",
       "      <td>&lt;http://spdx.org/licenses/Apache-2.0&gt;</td>\n",
       "      <td>Source Auditor Inc., Black Duck Software In.c,...</td>\n",
       "      <td>http://spdx.org/licenses/Apache-2.0, http://sp...</td>\n",
       "      <td>_:N2964943906914ce68eb3b521dc1f556b</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>&lt;http://spdx.org/spdxdocs/spdx-example-444504E...</td>\n",
       "      <td>./package/foo.c</td>\n",
       "      <td>spdx:fileType_source</td>\n",
       "      <td>&lt;http://spdx.org/spdxdocs/spdx-example-444504E...</td>\n",
       "      <td>IBM Corporation, IBM Corporation, Modified by ...</td>\n",
       "      <td>Ndf409e5541114a25ba5e1201c1b27fe4, Ndf409e5541...</td>\n",
       "      <td>_:N0aa53b380112478d81ed8cafa425e2a4</td>\n",
       "      <td>_:Na577ab75d0fa424d882fda85780bcc3f</td>\n",
       "      <td>The concluded license was taken from the packa...</td>\n",
       "      <td>The concluded license was taken from the packa...</td>\n",
       "      <td>Copyright (c) 2001 Aaron Lehmann aaroni@vitelu...</td>\n",
       "      <td>_:N25b78b43825a43dfb6b13246a5c329cb</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                              fileID  \\\n",
       "0  <http://spdx.org/spdxdocs/spdx-example-444504E...   \n",
       "1  <http://spdx.org/spdxdocs/spdx-example-444504E...   \n",
       "2  <http://spdx.org/spdxdocs/spdx-example-444504E...   \n",
       "3  <http://spdx.org/spdxdocs/spdx-example-444504E...   \n",
       "\n",
       "                                     fileName               fileType  \\\n",
       "0         ./lib-source/jena-2.6.3-sources.jar  spdx:fileType_archive   \n",
       "1  ./lib-source/commons-lang3-3.1-sources.jar  spdx:fileType_archive   \n",
       "2      ./src/org/spdx/parser/DOAPProject.java   spdx:fileType_source   \n",
       "3                             ./package/foo.c   spdx:fileType_source   \n",
       "\n",
       "                                       licenseInFile  \\\n",
       "0  <http://spdx.org/spdxdocs/spdx-example-444504E...   \n",
       "1              <http://spdx.org/licenses/Apache-2.0>   \n",
       "2              <http://spdx.org/licenses/Apache-2.0>   \n",
       "3  <http://spdx.org/spdxdocs/spdx-example-444504E...   \n",
       "\n",
       "                                        contributors  \\\n",
       "0   Apache Software Foundation, Hewlett Packard Inc.   \n",
       "1                         Apache Software Foundation   \n",
       "2  Source Auditor Inc., Black Duck Software In.c,...   \n",
       "3  IBM Corporation, IBM Corporation, Modified by ...   \n",
       "\n",
       "                                    licenseConcluded  \\\n",
       "0  http://spdx.org/spdxdocs/spdx-example-444504E0...   \n",
       "1                http://spdx.org/licenses/Apache-2.0   \n",
       "2  http://spdx.org/licenses/Apache-2.0, http://sp...   \n",
       "3  Ndf409e5541114a25ba5e1201c1b27fe4, Ndf409e5541...   \n",
       "\n",
       "                              checksum                         relationship  \\\n",
       "0  _:N8d065bb23af54166a7807b66fd413fc3  _:N5169ddfc0196483381a7f89eed5068a7   \n",
       "1  _:Nc213ffa88a6d48e3b10d0d7c11b6566e  _:Nb4a82500dd3d4bacb47e5fcf9e144605   \n",
       "2  _:N2964943906914ce68eb3b521dc1f556b                                  NaN   \n",
       "3  _:N0aa53b380112478d81ed8cafa425e2a4  _:Na577ab75d0fa424d882fda85780bcc3f   \n",
       "\n",
       "                                             comment  \\\n",
       "0                          This file belongs to Jena   \n",
       "1                          This file is used by Jena   \n",
       "2                                                NaN   \n",
       "3  The concluded license was taken from the packa...   \n",
       "\n",
       "                                     licenseComments  \\\n",
       "0                       This license is used by Jena   \n",
       "1                                                NaN   \n",
       "2                                                NaN   \n",
       "3  The concluded license was taken from the packa...   \n",
       "\n",
       "                                          noticeText  \\\n",
       "0                                                NaN   \n",
       "1  Apache Commons Lang\\nCopyright 2001-2011 The A...   \n",
       "2                                                NaN   \n",
       "3  Copyright (c) 2001 Aaron Lehmann aaroni@vitelu...   \n",
       "\n",
       "                            annotation  \n",
       "0                                  NaN  \n",
       "1                                  NaN  \n",
       "2                                  NaN  \n",
       "3  _:N25b78b43825a43dfb6b13246a5c329cb  "
      ]
     },
     "execution_count": null,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "PREFIX spdx:<http://spdx.org/rdf/terms#>\n",
    "SELECT \n",
    "(?file AS ?fileID)\n",
    "?fileName\n",
    "?fileType\n",
    "?licenseInFile\n",
    "(GROUP_CONCAT(?contributor; SEPARATOR=\", \") AS ?contributors)\n",
    "(GROUP_CONCAT(?licenseConcluded; SEPARATOR=\", \") AS ?licenseConcluded)\n",
    "?checksum\n",
    "?relationship\n",
    "?annotation\n",
    "?comment\n",
    "?licenseComments\n",
    "?noticeText\n",
    "WHERE {\n",
    "  ?file rdf:type spdx:File .\n",
    "  ?file spdx:fileName ?fileName .\n",
    "  ?file spdx:fileContributor ?contributor .\n",
    "  ?file spdx:licenseInfoInFile ?licenseInFile .\n",
    "  ?file spdx:licenseConcluded ?licenseConcluded .\n",
    "  ?file spdx:checksum ?checksum .\n",
    "  ?file spdx:copyrightText ?copyrightText .\n",
    "  ?file spdx:fileType ?fileType .\n",
    "  OPTIONAL {?file spdx:relationship ?relationship .}\n",
    "  OPTIONAL {?file spdx:annotation ?annotation . }\n",
    "  OPTIONAL {?file rdfs:comment ?comment . }\n",
    "  OPTIONAL {?file spdx:licenseComments ?licenseComments . }\n",
    "  OPTIONAL {?file spdx:noticeText ?noticeText . }\n",
    "}\n",
    "GROUP BY ?file\n",
    "\"\"\"\n",
    "\n",
    "kg.query_as_df(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "b10a183e-2933-4622-a814-484db1367ecb",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Warning: When  cdn_resources is 'local' jupyter notebook has issues displaying graphics on chrome/safari. Use cdn_resources='in_line' or cdn_resources='remote' if you have issues viewing graphics in a notebook.\n",
      "tmp.fig06.html\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "\n",
       "        <iframe\n",
       "            width=\"100%\"\n",
       "            height=\"600px\"\n",
       "            src=\"tmp.fig06.html\"\n",
       "            frameborder=\"0\"\n",
       "            allowfullscreen\n",
       "            \n",
       "        ></iframe>\n",
       "        "
      ],
      "text/plain": [
       "<IPython.lib.display.IFrame>"
      ]
     },
     "execution_count": null,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "pyvis_graph = kg.visualize_query(query, notebook=True)\n",
    "\n",
    "pyvis_graph.force_atlas_2based()\n",
    "pyvis_graph.show(\"tmp.fig06.html\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "2c2706ab-d673-4073-8f22-59ca064ce324",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>subject</th>\n",
       "      <th>object</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>&lt;http://spdx.org/spdxdocs/spdx-example-444504E...</td>\n",
       "      <td>_:N5169ddfc0196483381a7f89eed5068a7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>&lt;http://spdx.org/spdxdocs/spdx-example-444504E...</td>\n",
       "      <td>_:Nb4a82500dd3d4bacb47e5fcf9e144605</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>&lt;http://spdx.org/spdxdocs/spdx-example-444504E...</td>\n",
       "      <td>_:Na577ab75d0fa424d882fda85780bcc3f</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                             subject  \\\n",
       "0  <http://spdx.org/spdxdocs/spdx-example-444504E...   \n",
       "1  <http://spdx.org/spdxdocs/spdx-example-444504E...   \n",
       "2  <http://spdx.org/spdxdocs/spdx-example-444504E...   \n",
       "\n",
       "                                object  \n",
       "0  _:N5169ddfc0196483381a7f89eed5068a7  \n",
       "1  _:Nb4a82500dd3d4bacb47e5fcf9e144605  \n",
       "2  _:Na577ab75d0fa424d882fda85780bcc3f  "
      ]
     },
     "execution_count": null,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "SELECT ?subject ?object\n",
    "WHERE {\n",
    "    ?subject rdf:type spdx:File .\n",
    "    ?subject spdx:relationship ?object .\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "files = kg.query_as_df(query)\n",
    "files.head(5)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "0b348344-eff1-46ad-83a3-343d2043e38e",
   "metadata": {},
   "outputs": [],
   "source": [
    "#import networkx as nx\n",
    "#\n",
    "#subgraph = kglab.SubgraphMatrix(kg, query)\n",
    "#nx_graph = subgraph.build_nx_graph(nx.DiGraph(), bipartite=True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "4965cfae-a695-45f2-854e-0962a431300c",
   "metadata": {},
   "outputs": [],
   "source": [
    "#nx.density(nx_graph)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "f6eb3fda-78cb-4fe0-9a7b-28c03628a6dd",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "41b3760e-bb9e-4573-a730-5582ad6ebedd",
   "metadata": {},
   "source": [
    "### Packages"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "6462ca6d-e107-490b-9ca5-3d26a7fad52c",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>property</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>spdx:annotation</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>spdx:attributionText</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>spdx:checksum</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>spdx:copyrightText</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>spdx:description</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>spdx:downloadLocation</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>spdx:externalRef</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>spdx:filesAnalyzed</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>spdx:licenseComments</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>spdx:licenseConcluded</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>spdx:licenseDeclared</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>spdx:licenseInfoFromFiles</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>spdx:name</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>spdx:originator</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>spdx:packageFileName</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>spdx:packageVerificationCode</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>spdx:relationship</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>spdx:sourceInfo</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>spdx:summary</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>spdx:supplier</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>spdx:versionInfo</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>doap:homepage</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>rdf:type</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                        property\n",
       "0                spdx:annotation\n",
       "1           spdx:attributionText\n",
       "2                  spdx:checksum\n",
       "3             spdx:copyrightText\n",
       "4               spdx:description\n",
       "5          spdx:downloadLocation\n",
       "6               spdx:externalRef\n",
       "7             spdx:filesAnalyzed\n",
       "8           spdx:licenseComments\n",
       "9          spdx:licenseConcluded\n",
       "10          spdx:licenseDeclared\n",
       "11     spdx:licenseInfoFromFiles\n",
       "12                     spdx:name\n",
       "13               spdx:originator\n",
       "14          spdx:packageFileName\n",
       "15  spdx:packageVerificationCode\n",
       "16             spdx:relationship\n",
       "17               spdx:sourceInfo\n",
       "18                  spdx:summary\n",
       "19                 spdx:supplier\n",
       "20              spdx:versionInfo\n",
       "21                 doap:homepage\n",
       "22                      rdf:type"
      ]
     },
     "execution_count": null,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "PREFIX spdx:<http://spdx.org/rdf/terms#>\n",
    "SELECT DISTINCT ?property\n",
    "WHERE {\n",
    "  ?file rdf:type spdx:Package .\n",
    "  ?file ?property ?value .\n",
    "}\n",
    "order by asc(UCASE(str(?property)))\n",
    "\"\"\"\n",
    "\n",
    "\n",
    "df = kg.query_as_df(query)\n",
    "df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "5aacbe4a-5ff7-4610-9141-e511da3a0fc2",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>package</th>\n",
       "      <th>annotations</th>\n",
       "      <th>attributionTexts</th>\n",
       "      <th>checksums</th>\n",
       "      <th>copyrightText</th>\n",
       "      <th>downloadLocation</th>\n",
       "      <th>externalRefs</th>\n",
       "      <th>hasFiles</th>\n",
       "      <th>licenseConcluded</th>\n",
       "      <th>licenseDeclared</th>\n",
       "      <th>...</th>\n",
       "      <th>relationships</th>\n",
       "      <th>description</th>\n",
       "      <th>licenseComments</th>\n",
       "      <th>originator</th>\n",
       "      <th>packageFileName</th>\n",
       "      <th>packageVerificationCode</th>\n",
       "      <th>sourceInfo</th>\n",
       "      <th>summary</th>\n",
       "      <th>supplier</th>\n",
       "      <th>versionInfo</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>&lt;http://spdx.org/spdxdocs/spdx-example-444504E...</td>\n",
       "      <td></td>\n",
       "      <td></td>\n",
       "      <td></td>\n",
       "      <td>NOASSERTION</td>\n",
       "      <td>spdx:noassertion</td>\n",
       "      <td></td>\n",
       "      <td></td>\n",
       "      <td>spdx:noassertion</td>\n",
       "      <td>spdx:noassertion</td>\n",
       "      <td>...</td>\n",
       "      <td></td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>&lt;http://spdx.org/spdxdocs/spdx-example-444504E...</td>\n",
       "      <td>N085f576a95364e2b8d4d6617c2a6369d, N085f576a95...</td>\n",
       "      <td>The GNU C Library is free software.  See the f...</td>\n",
       "      <td>Nfa7a3c76393b434ab6da973ca6b772c1, Nfa7a3c7639...</td>\n",
       "      <td>Copyright 2008-2010 John Smith</td>\n",
       "      <td>http://ftp.gnu.org/gnu/glibc/glibc-ports-2.15....</td>\n",
       "      <td>Na3a0d075c07d497ba38131127c2107bc, Na3a0d075c0...</td>\n",
       "      <td></td>\n",
       "      <td>_:Na7cac89f115c426c9e3dbdb9ae108827</td>\n",
       "      <td>_:N4a45b0d236794bd19a74d8601335c0c8</td>\n",
       "      <td>...</td>\n",
       "      <td>N614c99865de6435c98bfa8258d56a422, N8bf969e757...</td>\n",
       "      <td>The GNU C Library defines functions that are s...</td>\n",
       "      <td>The license for this project changed with the ...</td>\n",
       "      <td>Organization: ExampleCodeInspect (contact@exam...</td>\n",
       "      <td>glibc-2.11.1.tar.gz</td>\n",
       "      <td>_:N6f4948534d724990a492ef5147e9e5a2</td>\n",
       "      <td>uses glibc-2_11-branch from git://sourceware.o...</td>\n",
       "      <td>GNU C library.</td>\n",
       "      <td>Person: Jane Doe (jane.doe@example.com)</td>\n",
       "      <td>2.11.1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>&lt;http://spdx.org/spdxdocs/spdx-example-444504E...</td>\n",
       "      <td></td>\n",
       "      <td></td>\n",
       "      <td>N2e06250e2a3b4eff85b406d5fc0894c7</td>\n",
       "      <td>Copyright Saxonica Ltd</td>\n",
       "      <td>https://sourceforge.net/projects/saxon/files/S...</td>\n",
       "      <td></td>\n",
       "      <td></td>\n",
       "      <td>&lt;http://spdx.org/licenses/MPL-1.0&gt;</td>\n",
       "      <td>&lt;http://spdx.org/licenses/MPL-1.0&gt;</td>\n",
       "      <td>...</td>\n",
       "      <td></td>\n",
       "      <td>The Saxon package is a collection of tools for...</td>\n",
       "      <td>Other versions available for a commercial license</td>\n",
       "      <td>NaN</td>\n",
       "      <td>saxonB-8.8.zip</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>8.8</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>&lt;http://spdx.org/spdxdocs/spdx-example-444504E...</td>\n",
       "      <td></td>\n",
       "      <td></td>\n",
       "      <td></td>\n",
       "      <td>NOASSERTION</td>\n",
       "      <td>https://search.maven.org/remotecontent?filepat...</td>\n",
       "      <td>N2f98b14e529f4cd09664d8ae47a7136f</td>\n",
       "      <td></td>\n",
       "      <td>spdx:noassertion</td>\n",
       "      <td>spdx:noassertion</td>\n",
       "      <td>...</td>\n",
       "      <td></td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>3.12.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>4 rows × 22 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                             package  \\\n",
       "0  <http://spdx.org/spdxdocs/spdx-example-444504E...   \n",
       "1  <http://spdx.org/spdxdocs/spdx-example-444504E...   \n",
       "2  <http://spdx.org/spdxdocs/spdx-example-444504E...   \n",
       "3  <http://spdx.org/spdxdocs/spdx-example-444504E...   \n",
       "\n",
       "                                         annotations  \\\n",
       "0                                                      \n",
       "1  N085f576a95364e2b8d4d6617c2a6369d, N085f576a95...   \n",
       "2                                                      \n",
       "3                                                      \n",
       "\n",
       "                                    attributionTexts  \\\n",
       "0                                                      \n",
       "1  The GNU C Library is free software.  See the f...   \n",
       "2                                                      \n",
       "3                                                      \n",
       "\n",
       "                                           checksums  \\\n",
       "0                                                      \n",
       "1  Nfa7a3c76393b434ab6da973ca6b772c1, Nfa7a3c7639...   \n",
       "2                  N2e06250e2a3b4eff85b406d5fc0894c7   \n",
       "3                                                      \n",
       "\n",
       "                    copyrightText  \\\n",
       "0                     NOASSERTION   \n",
       "1  Copyright 2008-2010 John Smith   \n",
       "2          Copyright Saxonica Ltd   \n",
       "3                     NOASSERTION   \n",
       "\n",
       "                                    downloadLocation  \\\n",
       "0                                   spdx:noassertion   \n",
       "1  http://ftp.gnu.org/gnu/glibc/glibc-ports-2.15....   \n",
       "2  https://sourceforge.net/projects/saxon/files/S...   \n",
       "3  https://search.maven.org/remotecontent?filepat...   \n",
       "\n",
       "                                        externalRefs hasFiles  \\\n",
       "0                                                               \n",
       "1  Na3a0d075c07d497ba38131127c2107bc, Na3a0d075c0...            \n",
       "2                                                               \n",
       "3                  N2f98b14e529f4cd09664d8ae47a7136f            \n",
       "\n",
       "                      licenseConcluded                      licenseDeclared  \\\n",
       "0                     spdx:noassertion                     spdx:noassertion   \n",
       "1  _:Na7cac89f115c426c9e3dbdb9ae108827  _:N4a45b0d236794bd19a74d8601335c0c8   \n",
       "2   <http://spdx.org/licenses/MPL-1.0>   <http://spdx.org/licenses/MPL-1.0>   \n",
       "3                     spdx:noassertion                     spdx:noassertion   \n",
       "\n",
       "   ...                                      relationships  \\\n",
       "0  ...                                                      \n",
       "1  ...  N614c99865de6435c98bfa8258d56a422, N8bf969e757...   \n",
       "2  ...                                                      \n",
       "3  ...                                                      \n",
       "\n",
       "                                         description  \\\n",
       "0                                                NaN   \n",
       "1  The GNU C Library defines functions that are s...   \n",
       "2  The Saxon package is a collection of tools for...   \n",
       "3                                                NaN   \n",
       "\n",
       "                                     licenseComments  \\\n",
       "0                                                NaN   \n",
       "1  The license for this project changed with the ...   \n",
       "2  Other versions available for a commercial license   \n",
       "3                                                NaN   \n",
       "\n",
       "                                          originator      packageFileName  \\\n",
       "0                                                NaN                  NaN   \n",
       "1  Organization: ExampleCodeInspect (contact@exam...  glibc-2.11.1.tar.gz   \n",
       "2                                                NaN       saxonB-8.8.zip   \n",
       "3                                                NaN                  NaN   \n",
       "\n",
       "               packageVerificationCode  \\\n",
       "0                                  NaN   \n",
       "1  _:N6f4948534d724990a492ef5147e9e5a2   \n",
       "2                                  NaN   \n",
       "3                                  NaN   \n",
       "\n",
       "                                          sourceInfo         summary  \\\n",
       "0                                                NaN             NaN   \n",
       "1  uses glibc-2_11-branch from git://sourceware.o...  GNU C library.   \n",
       "2                                                NaN             NaN   \n",
       "3                                                NaN             NaN   \n",
       "\n",
       "                                  supplier versionInfo  \n",
       "0                                      NaN         NaN  \n",
       "1  Person: Jane Doe (jane.doe@example.com)      2.11.1  \n",
       "2                                      NaN         8.8  \n",
       "3                                      NaN      3.12.0  \n",
       "\n",
       "[4 rows x 22 columns]"
      ]
     },
     "execution_count": null,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "PREFIX spdx:<http://spdx.org/rdf/terms#>\n",
    "SELECT ?package\n",
    "       (GROUP_CONCAT(?annotation; SEPARATOR=\", \") AS ?annotations)\n",
    "       (GROUP_CONCAT(?attributionText; SEPARATOR=\", \") AS ?attributionTexts)\n",
    "       ?builtDate\n",
    "       (GROUP_CONCAT(?checksum; SEPARATOR=\", \") AS ?checksums)\n",
    "       ?comment\n",
    "       ?copyrightText\n",
    "       ?description\n",
    "       ?downloadLocation\n",
    "       (GROUP_CONCAT(?externalRef; SEPARATOR=\", \") AS ?externalRefs)\n",
    "       ?filesAnalyzed\n",
    "       (GROUP_CONCAT(?hasFile; SEPARATOR=\", \") AS ?hasFiles)\n",
    "       ?homepage\n",
    "       ?licenseComments\n",
    "       ?licenseConcluded\n",
    "       ?licenseDeclared\n",
    "       (GROUP_CONCAT(?licenseInfoFromFile; SEPARATOR=\", \") AS ?licenseInfoFromFiles)\n",
    "       ?name\n",
    "       ?originator\n",
    "       ?packageFileName\n",
    "       ?packageVerificationCode\n",
    "       ?primaryPackagePurpose\n",
    "       ?releaseDate\n",
    "       ?sourceInfo\n",
    "       ?summary\n",
    "       ?supplier\n",
    "       ?validUntilDate\n",
    "       ?versionInfo\n",
    "       (GROUP_CONCAT(?relationship; SEPARATOR=\", \") AS ?relationships)\n",
    "WHERE {\n",
    "      ?package rdf:type spdx:Package .\n",
    "      OPTIONAL { ?package spdx:annotation ?annotation . }\n",
    "      OPTIONAL { ?package spdx:attributionText ?attributionText . }\n",
    "      OPTIONAL { ?package spdx:builtDate ?buildDate . }\n",
    "      OPTIONAL { ?package spdx:checksum ?checksum . }\n",
    "      OPTIONAL { ?package spdx:comment ?comment . }\n",
    "      OPTIONAL { ?package spdx:copyrightText ?copyrightText . }\n",
    "      OPTIONAL { ?package spdx:description ?description . }\n",
    "      OPTIONAL { ?package spdx:downloadLocation ?downloadLocation . }\n",
    "      OPTIONAL { ?package spdx:externalRef ?externalRef . }\n",
    "      OPTIONAL { ?package spdx:filesAnalyed ?filesAnalyzed . }\n",
    "      OPTIONAL { ?package spdx:hasFile ?hasFile . }\n",
    "      OPTIONAL { ?package spdx:homepage ?homepage . }\n",
    "      OPTIONAL { ?package spdx:licenseComments ?licenseComments . }\n",
    "      OPTIONAL { ?package spdx:licenseConcluded ?licenseConcluded . }\n",
    "      OPTIONAL { ?package spdx:licenseDeclared ?licenseDeclared . }\n",
    "      OPTIONAL { ?package spdx:licenseInfoFromFile ?licenseInfoFromFile . }\n",
    "      OPTIONAL { ?package spdx:name ?name . }\n",
    "      OPTIONAL { ?package spdx:originator ?originator . }\n",
    "      OPTIONAL { ?package spdx:packageFileName ?packageFileName . }\n",
    "      OPTIONAL { ?package spdx:packageVerificationCode ?packageVerificationCode . }\n",
    "      OPTIONAL { ?package spdx:primaryPackagePurpose ?primaryPackagePurpose . }\n",
    "      OPTIONAL { ?package spdx:releaseDate ?releaseDate . }\n",
    "      OPTIONAL { ?package spdx:sourceInfo ?sourceInfo . }\n",
    "      OPTIONAL { ?package spdx:summary ?summary . }\n",
    "      OPTIONAL { ?package spdx:supplier ?supplier . }\n",
    "      OPTIONAL { ?package spdx:validUntilDate ?validUntilDate . }\n",
    "      OPTIONAL { ?package spdx:versionInfo ?versionInfo . }\n",
    "      OPTIONAL { ?package spdx:relationship ?relationship . }\n",
    "}\n",
    "GROUP BY ?package\n",
    "\"\"\"\n",
    "\n",
    "pkgs = kg.query_as_df(query)\n",
    "pkgs.head(5)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b10f4bd9-9e55-4c51-95cf-a07e0dc82825",
   "metadata": {},
   "source": [
    "Construct a subgraph from this query"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "404e61a7-c0d8-43c7-9c3f-f14341ec3fc1",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "295e1015-16a2-4094-b265-58db72f9dbe5",
   "metadata": {},
   "source": [
    "### Relationships"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "d4a44c1a-fd66-44c6-9a97-3cb6edfd42bf",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>property</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>rdf:type</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>spdx:relationshipType</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>spdx:relatedSpdxElement</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                  property\n",
       "0                 rdf:type\n",
       "1    spdx:relationshipType\n",
       "2  spdx:relatedSpdxElement"
      ]
     },
     "execution_count": null,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "PREFIX spdx:<http://spdx.org/rdf/terms#>\n",
    "SELECT DISTINCT ?property\n",
    "WHERE {\n",
    "  ?file rdf:type spdx:Relationship .\n",
    "  ?file ?property ?value .\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "\n",
    "df = kg.query_as_df(query)\n",
    "df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "5bfc5279-fb99-477b-bace-6eff6430c130",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>element</th>\n",
       "      <th>elementType</th>\n",
       "      <th>relationshipType</th>\n",
       "      <th>relatedElement</th>\n",
       "      <th>relatedElementType</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>&lt;http://spdx.org/spdxdocs/spdx-example-444504E...</td>\n",
       "      <td>spdx:File</td>\n",
       "      <td>spdx:relationshipType_contains</td>\n",
       "      <td>&lt;http://spdx.org/spdxdocs/spdx-example-444504E...</td>\n",
       "      <td>spdx:Package</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>&lt;http://spdx.org/spdxdocs/spdx-example-444504E...</td>\n",
       "      <td>spdx:Package</td>\n",
       "      <td>spdx:relationshipType_contains</td>\n",
       "      <td>&lt;http://spdx.org/spdxdocs/spdx-example-444504E...</td>\n",
       "      <td>spdx:File</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>&lt;http://spdx.org/spdxdocs/spdx-example-444504E...</td>\n",
       "      <td>spdx:Package</td>\n",
       "      <td>spdx:relationshipType_dynamicLink</td>\n",
       "      <td>&lt;http://spdx.org/spdxdocs/spdx-example-444504E...</td>\n",
       "      <td>spdx:Package</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>&lt;http://spdx.org/spdxdocs/spdx-example-444504E...</td>\n",
       "      <td>spdx:Package</td>\n",
       "      <td>spdx:relationshipType_contains</td>\n",
       "      <td>&lt;http://spdx.org/spdxdocs/spdx-example-444504E...</td>\n",
       "      <td>spdx:File</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>&lt;http://spdx.org/spdxdocs/spdx-example-444504E...</td>\n",
       "      <td>spdx:Package</td>\n",
       "      <td>spdx:relationshipType_contains</td>\n",
       "      <td>&lt;http://spdx.org/spdxdocs/spdx-example-444504E...</td>\n",
       "      <td>spdx:File</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>&lt;http://spdx.org/spdxdocs/spdx-example-444504E...</td>\n",
       "      <td>spdx:SpdxDocument</td>\n",
       "      <td>spdx:relationshipType_contains</td>\n",
       "      <td>&lt;http://spdx.org/spdxdocs/spdx-example-444504E...</td>\n",
       "      <td>spdx:Package</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>&lt;http://spdx.org/spdxdocs/spdx-example-444504E...</td>\n",
       "      <td>spdx:File</td>\n",
       "      <td>spdx:relationshipType_generatedFrom</td>\n",
       "      <td>&lt;http://spdx.org/spdxdocs/spdx-example-444504E...</td>\n",
       "      <td>spdx:Package</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>&lt;http://spdx.org/spdxdocs/spdx-example-444504E...</td>\n",
       "      <td>spdx:SpdxDocument</td>\n",
       "      <td>spdx:relationshipType_describes</td>\n",
       "      <td>&lt;http://spdx.org/spdxdocs/spdx-example-444504E...</td>\n",
       "      <td>spdx:File</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>&lt;http://spdx.org/spdxdocs/spdx-example-444504E...</td>\n",
       "      <td>spdx:SpdxDocument</td>\n",
       "      <td>spdx:relationshipType_describes</td>\n",
       "      <td>&lt;http://spdx.org/spdxdocs/spdx-example-444504E...</td>\n",
       "      <td>spdx:Package</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                             element        elementType  \\\n",
       "0  <http://spdx.org/spdxdocs/spdx-example-444504E...          spdx:File   \n",
       "1  <http://spdx.org/spdxdocs/spdx-example-444504E...       spdx:Package   \n",
       "2  <http://spdx.org/spdxdocs/spdx-example-444504E...       spdx:Package   \n",
       "3  <http://spdx.org/spdxdocs/spdx-example-444504E...       spdx:Package   \n",
       "4  <http://spdx.org/spdxdocs/spdx-example-444504E...       spdx:Package   \n",
       "5  <http://spdx.org/spdxdocs/spdx-example-444504E...  spdx:SpdxDocument   \n",
       "6  <http://spdx.org/spdxdocs/spdx-example-444504E...          spdx:File   \n",
       "7  <http://spdx.org/spdxdocs/spdx-example-444504E...  spdx:SpdxDocument   \n",
       "8  <http://spdx.org/spdxdocs/spdx-example-444504E...  spdx:SpdxDocument   \n",
       "\n",
       "                      relationshipType  \\\n",
       "0       spdx:relationshipType_contains   \n",
       "1       spdx:relationshipType_contains   \n",
       "2    spdx:relationshipType_dynamicLink   \n",
       "3       spdx:relationshipType_contains   \n",
       "4       spdx:relationshipType_contains   \n",
       "5       spdx:relationshipType_contains   \n",
       "6  spdx:relationshipType_generatedFrom   \n",
       "7      spdx:relationshipType_describes   \n",
       "8      spdx:relationshipType_describes   \n",
       "\n",
       "                                      relatedElement relatedElementType  \n",
       "0  <http://spdx.org/spdxdocs/spdx-example-444504E...       spdx:Package  \n",
       "1  <http://spdx.org/spdxdocs/spdx-example-444504E...          spdx:File  \n",
       "2  <http://spdx.org/spdxdocs/spdx-example-444504E...       spdx:Package  \n",
       "3  <http://spdx.org/spdxdocs/spdx-example-444504E...          spdx:File  \n",
       "4  <http://spdx.org/spdxdocs/spdx-example-444504E...          spdx:File  \n",
       "5  <http://spdx.org/spdxdocs/spdx-example-444504E...       spdx:Package  \n",
       "6  <http://spdx.org/spdxdocs/spdx-example-444504E...       spdx:Package  \n",
       "7  <http://spdx.org/spdxdocs/spdx-example-444504E...          spdx:File  \n",
       "8  <http://spdx.org/spdxdocs/spdx-example-444504E...       spdx:Package  "
      ]
     },
     "execution_count": null,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "PREFIX spdx:<http://spdx.org/rdf/terms#>\n",
    "SELECT ?element ?elementType ?relationshipType ?relatedElement ?relatedElementType\n",
    "WHERE {\n",
    "  ?element spdx:relationship ?relationship .\n",
    "  ?element rdf:type ?elementType .\n",
    "  ?relationship spdx:relatedSpdxElement ?relatedElement .\n",
    "  ?relationship spdx:relationshipType ?relationshipType .\n",
    "  ?relatedElement rdf:type ?relatedElementType .\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "#for row in kg.query(query):\n",
    "#    print(row.asdict())\n",
    "#    print()\n",
    "\n",
    "\n",
    "df = kg.query_as_df(query)\n",
    "df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "fb1a2943-6b18-480f-b348-df84b88b9d9a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Warning: When  cdn_resources is 'local' jupyter notebook has issues displaying graphics on chrome/safari. Use cdn_resources='in_line' or cdn_resources='remote' if you have issues viewing graphics in a notebook.\n",
      "tmp.fig.html\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "\n",
       "        <iframe\n",
       "            width=\"100%\"\n",
       "            height=\"600px\"\n",
       "            src=\"tmp.fig.html\"\n",
       "            frameborder=\"0\"\n",
       "            allowfullscreen\n",
       "            \n",
       "        ></iframe>\n",
       "        "
      ],
      "text/plain": [
       "<IPython.lib.display.IFrame>"
      ]
     },
     "execution_count": null,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "namespaces = {\n",
    "    \"spdx\": \"http://spdx.org/rdf/terms#\",\n",
    "    \"this\": \"http://spdx.org/spdxdocs/spdx-example-444504E0-4F89-41D3-9A0C-0305E82C3301#\"\n",
    "}\n",
    "subgraph = kglab.KnowledgeGraph(\n",
    "    namespaces = namespaces,\n",
    ")\n",
    "query = \"\"\"\n",
    "PREFIX spdx:<http://spdx.org/rdf/terms#>\n",
    "CONSTRUCT {\n",
    "  ?element spdx:relationship ?relationship .\n",
    "  ?element rdf:type ?elementType .\n",
    "  ?relationship spdx:relatedSpdxElement ?relatedElement .\n",
    "  ?relationship spdx:relationshipType ?relationshipType .\n",
    "  ?relatedElement rdf:type ?relatedElementType .\n",
    "}\n",
    "WHERE {\n",
    "  ?element spdx:relationship ?relationship .\n",
    "  ?element rdf:type ?elementType .\n",
    "  ?relationship spdx:relatedSpdxElement ?relatedElement .\n",
    "  ?relationship spdx:relationshipType ?relationshipType .\n",
    "  ?relatedElement rdf:type ?relatedElementType .\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "for row in kg.query(query):\n",
    "    s, p, o = row\n",
    "    subgraph.add(s, p, o)\n",
    "    \n",
    "VIS_STYLE = {\n",
    "    \"spdx\": {\n",
    "        \"color\": \"orange\",\n",
    "        \"size\": 40,\n",
    "    },\n",
    "    \"this\":{\n",
    "        \"color\": \"green\",\n",
    "        \"size\": 30,\n",
    "    },\n",
    "}\n",
    "g = kglab.SubgraphTensor(subgraph)\n",
    "pyvis_graph = g.build_pyvis_graph(notebook=True, style=VIS_STYLE)\n",
    "pyvis_graph.force_atlas_2based()\n",
    "pyvis_graph.show(\"tmp.fig.html\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "40c1eee8-bc8c-405f-8d86-1f16f06c437c",
   "metadata": {},
   "source": [
    "## Visualization"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "3b384e6c-9254-4423-8a3c-42669cd37611",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Warning: When  cdn_resources is 'local' jupyter notebook has issues displaying graphics on chrome/safari. Use cdn_resources='in_line' or cdn_resources='remote' if you have issues viewing graphics in a notebook.\n"
     ]
    }
   ],
   "source": [
    "VIS_STYLE = {\n",
    "    \"spdx\": {\n",
    "        \"color\": \"orange\",\n",
    "        \"size\": 40,\n",
    "    },\n",
    "    \"rdf\":{\n",
    "        \"color\": \"blue\",\n",
    "        \"size\": 30,\n",
    "    },\n",
    "    \"ptr\":{\n",
    "        \"color\": \"red\",\n",
    "        \"size\": 20,\n",
    "    },\n",
    "}\n",
    "\n",
    "subgraph = kglab.SubgraphTensor(kg)\n",
    "pyvis_graph = subgraph.build_pyvis_graph(notebook=True, style=VIS_STYLE)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "4dfd8abe-bc04-4b60-aeab-115e65403cb2",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "tmp.fig03.html\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "\n",
       "        <iframe\n",
       "            width=\"100%\"\n",
       "            height=\"600px\"\n",
       "            src=\"tmp.fig03.html\"\n",
       "            frameborder=\"0\"\n",
       "            allowfullscreen\n",
       "            \n",
       "        ></iframe>\n",
       "        "
      ],
      "text/plain": [
       "<IPython.lib.display.IFrame>"
      ]
     },
     "execution_count": null,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "pyvis_graph.force_atlas_2based()\n",
    "pyvis_graph.show(\"tmp.fig03.html\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "84f4bbd6-ce4a-4243-bdd2-fab680b74688",
   "metadata": {},
   "outputs": [],
   "source": [
    "#| default_exp core"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "local-venv",
   "language": "python",
   "name": "local-venv"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
